app/Http/Controllers/BetController.php

        $attributes['user_id'] = auth()->id();

        // persist
        Bet::create($attributes);
---
insert into `bets` (`match`, `bet_size`, `sport`, `match_date`, `match_time`, `bookie`, `bet_type`, `bet_description`, `bet_pick`, `american_odd`, `decimal_odd`, `user_id`, `updated_at`, `created_at`) values ('Flamengo vs River Plate', '300', 'Soccer', '2022-10-27', '21:45', 'Bet365', 'simple', 'Libertadores Final', 'Flamengo', '500', 6, 1, '2022-10-26 13:10:49', '2022-10-26 13:10:49')

    public function stats()
    {
        $avgDecimalOdds = Bet::where('user_id', auth()->user()->id)->avg('decimal_odd');
        $avgAmericanOdds = Bet::where('user_id', auth()->user()->id)->avg('american_odd');

        return view('bets.stats', [
            'totalBets' => Bet::where('user_id', auth()->user()->id)
                ->count(),

            'totalWinBets' => Bet::where('user_id', auth()->user()->id)
                ->where('result', 1)->count(),

            'totalLossBets' => Bet::where('user_id', auth()->user()->id)
                ->where('result', 0)->count(),

            'totalNaBets' => Bet::where('user_id', auth()->user()->id)
                ->where('result', null)->count(),

            'averageOdds' => auth()->user()->odd_type === 'decimal' ? number_format($avgDecimalOdds, 3) : number_format($avgAmericanOdds, 3),

            'impliedProbability' => $avgDecimalOdds ? number_format(100 * (1 / $avgDecimalOdds), 2)
                                                    : null,

            'totalGains' =>  Bet::where('user_id', auth()->user()->id)
                ->where('result', 1)
                ->get()
                ->map(fn ($bet) => $bet->payoff())
                ->sum(),

            'totalLosses' =>  Bet::where('user_id', auth()->user()->id)
                ->where('result', 0)
                ->pluck('bet_size')
                ->sum(),

            'biggestBet' => Bet::where('user_id', auth()->user()->id)
                ->max('bet_size'),

            'biggestPayoff' => Bet::where('user_id', auth()->user()->id)
                ->where('result', 1)
                ->get()
                ->map(fn ($bet) => $bet->payoff())
                ->max(),
---
select avg(`decimal_odd`) as aggregate from `bets` where `user_id` = 1
select * from `bets` where `user_id` = 1
select * from `bets` where `user_id` = 1 and `result` = 1
select count(*) as aggregate from `bets` where `user_id` = 1 and `result` = 1
select count(*) as aggregate from `bets` where `user_id` = 1 and `result` = 0
select count(*) as aggregate from `bets` where `user_id` = 1 and `result` is null
select `bet_size` from `bets` where `user_id` = 1 and `result` = 0
select max(`bet_size`) as aggregate from `bets` where `user_id` = 1 and `result` = 0
select max(`bet_size`) as aggregate from `bets` where `user_id` = 1

                ->where('result', 0)
                ->max('bet_size'),

            'betResults' => Bet::where('user_id', auth()->user()->id)
                ->get()
                ->groupBy('result')
                ->map( fn ($betResults) => $betResults->count() )
                ->values()
                ->toArray()
---
select max(`bet_size`) as aggregate from `bets` where `user_id` = 1 and `result` = 0