app/Http/Controllers/ProfileController.php

update `users` set `odd_type` = 'american', `users`.`updated_at` = '2022-10-26 18:57:40' where `id` = 1
---
    public function update(Request $request)
    {

        $attributes = $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => [
                'required', 'string', 'email', 'max:255',
                Rule::unique('users', 'email')->ignore(auth()->user()->id)
            ],
            'password' => ['nullable', 'confirmed', Rules\Password::defaults()],
            'odd_type' => ['required', 'string']
        ]);

        $request->whenFilled('password', function ($password) use(&$attributes) {

            $attributes['password'] = Hash::make($password);

        }, function () use(&$attributes) {

            unset($attributes['password']);

        });

        auth()->user()->update($attributes);